---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteElemInViewError
source: html/35d9a05a-57dc-eed2-5ba5-46a38f670cd2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteElemInViewError Property

Cannot paste the contents into %1!s! view. Attempt to paste into an appropriate view.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPasteElemInViewError { get; }
```